app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2016-11-29 19:16:32 UTC], ["updated_at", 2016-11-29 19:16:32 UTC]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 2], ["created_at", 2016-11-29 19:17:29 UTC], ["updated_at", 2016-11-29 19:17:29 UTC]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", 2016-11-29 19:24:25 UTC], ["id", 1]]
---
  def create
    product = Product.find(params[:product_id])
    #@line_item = @cart.line_items.build(product:product)
    @line_item = @cart.add_item(product.id)
    #line_item = LineItem.new(line_item_params)
    respond_to do |format|
      if @line_item.save