app/controllers/orders_controller.rb

  def new
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 10], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 10]]

  def create
    @order = Order.new(order_params)

    @order.add_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "li"], ["address", "12street"], ["email", "email"], ["pay_type", "Credit Card"], ["created_at", 2016-12-02 05:42:20 UTC], ["updated_at", 2016-12-02 05:42:20 UTC]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 17]]