app/controllers/users_controller.rb

  def index
    #@users = User.all
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "admin"], ["password_digest", "$2a$10$N9taoIquR1tgUpNyvVRhKuvZCVgTL2GGurPRPDxuL949AX4xdbwcy"], ["created_at", 2016-12-03 23:53:44 UTC], ["updated_at", 2016-12-03 23:53:44 UTC]]